Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: c) The organization identifies the conditions or events that trigger a fresh audit of the product's source code or of the incremental changes to a code base whose OSS compliance had previously been verified.
ja: c) 組織は、製品のソース コードを改めて監査する必要のある条件やイベント、あるいは、OSS コンプライアンスが検証されているコードベースにさらに変更を加える必要のある条件やイベントを特定する。◆◆

source: A project management tool is essential to manage and track the compliance activities.
ja: プロジェクト管理ツールは、コンプライアンス業務を管理および追跡するために必要です。

source: Buy a Board
ja: ボードを買う

source: Mandate engineers to fill out OSRB forms8 to inform the OSRB of their intention to use FOSS source code in a proprietary or 3rd party software, or as a standalone.
ja: プロプライエタリ ソフトウェア、サード パーティ ソフトウェアと一緒に、またはスタンドアロンで FOSS を使用する意図を OSRB に通知するための OSRB 文書を技術者に記入させる。

source: Build a distribution bottom-up starting with a toolchain and the Linux kernel.
ja: ツールチェーンと Linux カーネルから開始し、ボトムアップでディストリビューションをビルドします。

source: For the compile step tools is a toolchain typically comprised of a compiler, assembler, linker, make utility, autoconf etc.
ja: コンパイル ステップで使用されるツールは、通常、コンパイラー、アセンブラー、リンカー、make ユーティリティ、autoconf、などから成るツールチェーンです。

source: One of the few shortcomings in the UEFI model (and it is a deliberate omission because of the complexity of running a certification system) is that there’s no designated root of trust in the current proposals.
ja: UEFI モデルの不完全な欠点の 1 つ (認証システムを運用することの複雑さのため、敢えて欠落しているもの) は、現行案に確実な信頼の起点 (root of trust) がないことです。

source: Compliance Teams
ja: コンプライアンス チーム

source: Source Code Auditing
ja: ソース コード監査

source: If the source code scanning tool identifies for instance the use of unauthorized GPL licensed source code within a proprietary component (that must remain proprietary), this will be reported to Engineering with a request for correction.
ja: ソース コード スキャン ツールを実行した結果、たとえば、プロプライエタリ コンポーネント (そのコンポーネントはプロプライエタリとして維持するものとして) で、GPL ライセンスのソース コードが不正に使用されていることがわかった場合は、これを修正リクエストとともに技術担当者に報告します。

source: For each architecture, OBS provides one scheduler service.
ja: 各アーキテクチャに対し、OBS は 1 つのスケジューラー サービスを提供します。

source: OSRB Open Source Review Board
ja: OSRB Open Source Review Board (オープンソース調査委員会)

source: Typically, training is delivered at the client’s site to encourage frank and open discussion of compliance issues.
ja: コンプライアンス問題について率直でオープンな討論が望ましいため、通常トレーニングは受講者のオフィスで行われます。

source: Offer training to avoid linking software components with conflicting licenses or to those software components whose license has a viral effect
ja: 矛盾するライセンスを持つソフトウェア コンポーネント間のリンクや、バイラル効果のあるライセンスを持つソフトウェア コンポーネントへのリンクを回避するためのトレーニングを実施する。

source: Training and experiential learning opportunities are provided to build necessary skillsets.
ja: 必要なスキルセットを習得するためのトレーニングや経験学習の機会が提供されている。

source: A dependency checker tool to identify the interactions of any given software component with other software components used in the product
ja: 指定されたソフトウェア コンポーネントと、製品で使用されている別のソフトウェア コンポーネントとの相互関係を識別する依存状態チェッカー ツール

source: The goal of this review is to ensure that architectural guidelines are respected and that the interactions between FOSS, proprietary and third party software are within the acceptable legal guidelines.
ja: このレビューの目的は、アーキテクチャ ガイドラインが尊重され、FOSS、プロプライエタリ、およびサードパーティ ソフトウェア間の相互関係が法的ガイドラインに沿っていることを確認することです。

source: Compliancetools andautomation
ja: コンプライアンス ツールと自動化

source: iii)Use cases and pilot projects are defined.
ja: iii) 使用事例とパイロット プロジェクトが定義されていること。

source: When in doubt with the scan results, discuss with Engineering (interview the developers responsible for the specific software component in question).
ja: スキャン結果に疑問がある場合は、技術担当者と検討します (対象となるソフトウェア コンポーネントの開発者に尋ねる)。

source: It generates the necessary metadata for publishing and pushes the packages to download servers.
ja: パブリッシャーは、パブリッシュに必要なメタデータを生成し、ダウンロード サーバーにパッケージをプッシュします。

source: Obligation Satisfaction covers compliance practices needed to satisfy OSS license obligations
ja: 「義務の履行」には、OSS ライセンス義務を履行するために必要なコンプライアンス プラクティスが含まれます。

source: Table 1 illustrates the most common compliance failures that occur during the software development process, a brief description of the failure and how it occurs, in addition to measures that a company can implement to avoid and prevent such failures from happening again.
ja: 表 1 は、ソフトウェアの開発過程で発生する最も一般的なコンプライアンス違反を表したもので、違反の種類と発生理由、および企業による違反の回避方法や再発防止方法を説明しています。

source: Bill of Material (BoM) Difference Checker: capable of reporting differences between BoMs and therefore enabling companies to identify changed source code components and to better report included open source components in updated product releases.
ja: Bill of Material (BoM) Difference Checker (BoM 比較ツール): このツールはソフトウェアのバージョン間での BoM（構成表）の差分をチェックします。企業は、差分のソース コード コンポーネントだけを確認すればよいため、アップデート製品リリースに含まれるオープン ソース コンポーネントの報告が容易になります。

source: MeeGo Projects http://meego.com/projects MeeGo Source Code http://meego.gitorious.org/ MeeGo Bugzilla http://bugs.meego.com/
ja: MeeGo プロジェクト http://meego.com/projects MeeGo ソース コード http://meego.gitorious.org/ MeeGo Bugzilla http://bugs.meego.com/

source: Signer
ja: サイナー

source: Industry best practices, do’s and don’ts, architectural guidelines
ja: 業界のベスト プラクティス、やるべきこととやってはいけないこと、ソフトウェア アーキテクチャ ガイドライン

source: To learn more about The Linux Foundation, the Open Compliance Program or our other initiatives, please visit us at http://www.linuxfoundation.org/.
ja: The Linux Foundation、オープン コンプライアンス プログラムおよびその他の活動については、http://www.linuxfoundation.org/ を参照してください。

source: Introduction to Android
ja: Introduction to Android (Android 入門)

source: A source code scan has been completed and an audit report is generated identifying the origins and licenses of the source code and flagging source code files that were not identified and that need further investigation.
ja: ソース コード スキャンが完了し、監査レポートが生成される。監査レポートは、ソース コードの出自とライセンスを特定するほか、特定できないソースコード、およびさらなる調査が必要なソース コードファイルについて警告する。

source: Opensourcesoftwarebasics
ja: オープン ソース ソフトウェアの基本知識

source: The submitter provides information regarding the intended use of the FOSS package for review and approval.
ja: 申請者は、対象となる FOSS パッケージについて、調査や承認手続きに必要な情報を提供します。

source: Various reviews are performed, as depicted in Figure 7, and all identified issues must be resolved.
ja: 図 7 にあるような各種の調査が実施され、検出されたすべての問題を解決しなければなりません。

source: Open Compliance Directory and Rapid Alert System:
ja: オープン コンプライアンス ディレクトリと緊急警報システム:

source: Using the base URL (e.g. https://api.opensuse.org) which requires proper authentication, or
ja: 正規の認証が必要なベース URL (https://api.opensuse.org など) を使用する。または、

source: Companies need internal compliance communication to ensure that employees are aware of what is involved when they include FOSS in a commercial product and to ensure that they are educated about the company's compliance policies, processes, and guidelines.
ja: 企業には、商品に FOSS を組み込むとどうなるのかを確実に従業員に認識させるために、また、企業のコンプライアンス ポリシー、プロセス、およびガイドラインについての教育を確実に従業員に受けさせるために、社内のコンプライアンス コミュニケーションが必要です。

source: Open source licensing basics
ja: オープン ソース ライセンスの基本知識

source: - Create a bill of material of scanned code
ja: スキャンされたコードの BoM (構成表) を作成する

source: This paper is accompanied by two other papers, the first one demonstrating the usage of OBS with the MeeGo Build Service [1] and the second one providing step-by-step instructions on how to setup an OBS instance [2].
ja: このホワイトペーパーは、前半と後半に分かれており、前半部分は OBS と MeeGo Build Service の使用についての説明 [1]、後半部分は OBS インスタンスのセットアップ方法の手順 [2] になります。

source: Processes are detailed specifications as to how a company will implement these rules on a daily basis.
ja: プロセスとは、企業がこれらの規則 (ポリシー) を日々どのように実行するかを示す詳細な仕様です。

source: Internal Communication
ja: 社内のコミュニケーション

source: - Reproduce the entire text of the license agreements for the FOSS code included in the product.
ja: 製品に組み込まれている FOSS コードのライセンス契約書の全文を転載する

source: The organization identifies individuals with the skills, insights, and interest needed to contribute to the compliance function.
ja: 組織は、コンプライアンスの任務に関わるために必要なスキル、見識、および関心を持つ人材を特定する。◆

source: Figure 1 presents a break down of the different departments responsible for achieving FOSS compliance.
ja: 図 1 は、FOSS コンプライアンスを遂行する責任を負う部門を表しています。

source: "Secure boot" is a technology described by recent revisions of the UEFI specification; it offers the prospect of a hardware-verified, malware-free operating system bootstrap process that can improve the security of many system deployments.
ja: "Secure boot (セキュア ブート)" は、最近の UEFI (Unified EFI) 仕様で規格化された技術です。secure boot は、ハードウェアによって検証された、マルウェアのない オペレーティング システム (OS) ブートストラップを可能とし、システム実装時のセキュリティを向上させます。

source: Legal must update that specific end user license agreement to reflect that the product contains FOSS and as part of the agreement provide information on how the end user can contact the company to receive information on how to access the source code of applicable FOSS (such as GPL source code).
ja: 対応するエンドユーザー ライセンス同意書に対し、製品に FOSS が含まれるということを反映させます。また、適用される FOSS のソース コード (GPL ソース コードなど) へのアクセス情報を入手する際の企業への問い合わせ方法について、同意書に含めます。

source: Company to cease binary distribution of the FOSS in question until it has published complete corresponding source code on its web site
ja: 企業は、その Web サイトにおいてすべての対応するソース コードを公開するまで、その対象となる FOSS のバイナリ配布を行わない

source: Community
ja: コミュニティ

source: Registration of the approved FOSS in the software inventory
ja: 承認された FOSS をソフトウェア インベントリに登録する

source: Following this model, the source code built into a product is incoming from various sources:
ja: マルチソース開発モデルの場合、製品に組み込まれているソース コードとして、次のようなものが考えられます。

source: In addition, the OSRB provides guidance on FOSS questions incoming from company staff and engineers.
ja: また、OSRB は、社内のスタッフや技術者からの FOSS 関連の疑問に対する助言を行います。

source: OBS provides a set of open and well-documented APIs allowing clients, IDE integrations and external services to interface with OBS components and utilize their resources.
ja: OBS は、オープンでドキュメントの整備された API セットを提供することで、クライアント、IDE 統合、外部サービスなどが OBS コンポーネントと連動し、そのリソースを利用できるようにします。

source: These sessions can also include discussions of the company's compliance program, policies, and processes.
ja: これらのセッションには、企業のコンプライアンス プログラム、ポリシー、プロセスなどの議論も含まれる場合があります。

source: case, the change log file would look like:
ja: 場合は、下記の例のように記載されています。

source: e)The OSRB considers and provides architectural guidelines and/or requirements for OSS inclusion in products to be distributed.
ja: e) OSRB は、出荷製品に OSS を含める際のアーキテクチャ ガイドラインや要件を検討および提供すること。

source: Responsibilities
ja: 責任

source: An organizational policy enables the company to incorporate and use OSS in their products.
ja: 組織のポリシーにより、自社製品に OSS を組み込んで利用することが認められること。

source: A bill of material (BoM) difference tool to identify the changes introduced to the BoM of any given product given two different builds
ja: 任意の製品の 2 種類のビルドの BoM を比較し、変更状況を識別できる BoM (構成リスト) 比較ツール

source: An example of a change log at the beginning of the source code file looks as follows:
ja: ソース コード ファイルの冒頭に変更記録を記載している例:

source: Registry of open source
ja: オープン ソースの登録簿

source: It keeps the delta with the previous scan to a minimum.
ja: 前回のスキャンとの差分が最小限に抑えられる。

source: Uploading the MythTV package into FOSSology via a URL pointer
ja: URL ポインターを介して、MythTV パッケージを FOSSology にアップロードする

source: Distribution of source code as part of the compliance end-to-end process
ja: コンプライアンス プロセスの「ソース コードの配布」ステップ

source: An Open System will likely generate a new PK at first boot, install the public component and save the private component to external media for the user.
ja: オープン システムは、初回のブート時に新しいプラットフォーム鍵を生成したうえで、その公開コンポーネントをインストールし、秘密コンポーネントを外部メディアに保存します。

source: By describing the solution to the problem as a ‘defined format of file to accompany any software package,’ the SPDX(TM) effort eases the exchange of license information between companies by looking at three areas: facts that deal with identification, facts that provide overview information, and facts that provide file-specific information about the software package.
ja: SPDX™ の活動は、「すべてのソフトウェア パッケージに定義されたフォーマットのファイルを添付する」ことにより、問題を解決しようとするものです。ライセンス情報を企業間で簡単に交換するために、3 つの区分域を設けています。それは、識別のための区分、概要情報を提供する区分、およびソフトウェア パッケージのファイル別情報を提供する区分です。

source: Hosting and sponsoring key kernel developers, like Linux creator Linus Torvalds, so they can maintain independence while working full time to improve Linux
ja: Linux 創設者 Linus Torvalds をはじめとする主要なカーネル開発者が、中立な立場を保ちながら Linux 発展のためにフルタイムで作業できるよう支援します。

source: How to Use the Checklist
ja: チェックリストの使用方法

source: Learn the Ecosystem
ja: エコシステムを学ぶ

source: The Open Compliance Program offers comprehensive training and informational materials, open source tools, an online community (FOSSBazaar), a best practices checklist, a rapid alert directory of company's compliance officers and a standard to help companies uniformly tag and report software used in their products.
ja: オープン コンプライアンス プログラムは、包括的なトレーニングや情報資料、オープン ソース ツール、オンライン コミュニティ (FOSSBazaar)、ベストプラクティス チェックリスト、企業のコンプライアンス オフィサーの緊急警報ディレクトリ、製品で使用しているソフトウェアを一様に認識およびレポートするための標準などを提供します。

source: Through the web browser via file selection window
ja: Web ブラウザのファイル選択ウィンドウから

source: If a worker does not shut down cleanly after building or is otherwise stuck building a package the warden can terminate it and return it to the worker pool.
ja: ワーカーがビルド後に正常にシャットダウンしなかったり、パッケージのビルドに手間取っていたりすると、ウォードンがワーカーを停止し、ワーカー プールに戻します。

source: Disclosure of open source use by third party suppliers
ja: サード パーティ サプライヤーによるオープン ソース使用の開示

source: MeeGo is a Linux-based platform built for the next-generation of computing devices.
ja: MeeGo は、次世代コンピューティング デバイス向けに構築された、Linux ベース のプラットフォームです。

source: The OSRB Legal representative updates the corporate end user license agreement to include appropriate references to FOSS.
ja: OSRB の法律顧問は、企業のエンドユーザー ライセンス同意書を更新し、FOSS について適切に言及します。

source: The Dispatcher
ja: ディスパッチャー

source: It is your responsibility to resolve the issue with the reporter, while being collaborative and showing good will.
ja: 協力的に、そして誠意を持って報告者の問題を解決することがあなたの務めです。

source: Mechanisms are used to determine the differences in software content between individual releases of a product for distribution.
ja: 配布製品のバージョン間に存在するソフトウェア コンテンツの差異を確認するために、メカニズム (ツール) が使用されている。

source: In 2001, a special team was created to insure both open source license compliance, and the protection of company intellectual property in their open source contributions.
ja: 2001 年には、オープン ソース ライセンス コンプライアンスと、オープン ソース コントリビューションにおける企業の知的財産保護とを保証する目的で、特別なチームが編成されました。

source: Challenges facing enterprises in establishing and achieving compliance and how to overcome them
ja: コンプライアンスの確立と実現において企業が直面する難題とその克服方法

source: The compliance strategy establishes what must be done to ensure compliance and offers a governing set of principles for how personnel interact with FOSS.
ja: コンプライアンス戦略は、確実にコンプライアンスを実行するためには何を行うべきかを規定し、社員と FOSS との関係を管理する基本原理を提供します。

source: Overview of Open Source Compliance End-to-End Process
ja: オープン ソース コンプライアンスの詳細なプロセス (英語)

source: Furthermore, a recommended practice is to provide email and snail mail contact information for any compliance or FOSS-related questions.
ja: また、コンプライアンスや FOSS 関連の質問に答えられるよう、問い合わせ先の住所や電子メール アドレスなどの情報を提供することをお勧めします。

source: One of the key obligations of using FOSS is the documentation obligation, also referred to as the notice obligation.
ja: FOSS を使用する上で重要な義務は、ドキュメント記載の義務、つまり告知義務です。

source: Updating Documentation
ja: ドキュメントの更新

source: In addition, the acquiring company may include provisions in the purchase agreement requiring the disclosure of FOSS that is subject to the transaction.
ja: また、買収側企業は、取引に関わる FOSS の開示要求を購入契約の条件に含めることができます。

source: Inform
ja: 通知

source: Because there are so many stakeholders, the SPDX(TM) Working Group has formulated a straightforward charter:
ja: 影響を受ける関係者が多いため、SPDX(TM) ワーキング グループでは、次のような簡単なチャーターを作成しました。

source: According to the FSF, to label translations as unofficial, you need to add the following text at the beginning, both in English and in the language of the translation.
ja: FSF によれば、翻訳版が非公式であることを明示するには、対象となる英語原文と翻訳文の冒頭に、次の文言を加える必要があります。

source: We will discuss these tools in a separate paper focused on this specific topic.
ja: これらのツールについては、テーマ別のホワイトペーパーで説明する予定です。

source: ii)Follow-up actions are taken to assure planned training is completed.
ja: ii) 計画されたトレーニングの完了を確認するための追跡作業を行う。

source: Figure 2 illustrates a sample compliance end-to-end process and displays in which phases of the compliance process the tools are being used.
ja: 図 2 は、詳細なコンプライアンス プロセスのサンプルです。コンプライアンス プロセスのどの段階でツールが使用されるかを表しています。

source: a)A systematic approach to tool evaluation is taken.
ja: a) 体系的なツール評価手段を採用している。

source: The external portal offers the company a window to the world and the FOSS community and a venue to post all the source code of FOSS packages they use, in fulfillment of their license obligations.
ja: 外部ポータルは、外部世界や FOSS コミュニティへの企業の窓口であり、ライセンス義務に従って、彼らが使用する FOSS パッケージのすべてのソース コードを掲示する場所でもあります。

source: OBS is an efficient platform for collaboration.
ja: OBS は、コラボレーションに最適の効率的なプラットフォームです。

source: The FOSSology software, available at http://fossology.org, analyzes the source code used in a project and reports the licenses being used.
ja: http://fossology.org から入手できる FOSSology ソフトウェアは、プロジェクトで使用されたソース コードを解析し、使用されているライセンスを報告します。

source: Strong / Satisfactory / Weak / Not Done
ja: 強い/ふつう/弱い/していない

source: It is now generally accepted that the future will involve a blend of both proprietary and open-source software.“
ja: 将来はプロプライエタリとオープンソース ソフトウェアが混じり合った世界になるということを、人々は認めている」と報じています。

source: Please see http://www.linuxfoundation.org/programs/legal/compliance/trainingand-education for course descriptions.
ja: コースの説明については、http://www.linuxfoundation.org/programs/legal/compliance/training-and-education を参照してください。

source: Verification that the package has been uploaded correctly.
ja: パッケージが正常にアップロードされていることの検証。

source: The objectives of compliance and the benefits resulting from having a successful compliance program
ja: コンプライアンスの目的と、優れたコンプライアンス プログラムがもたらすメリット

source: Automation / Tool Support examines the organization's use and consideration of tools to support its compliance activities.
ja: 「自動化 / ツール サポート」は、コンプライアンス作業を支援するために、組織によるツールの利用や考慮点について分析します。

source: Failure to comply can carry severe consequences, potentially including loss of license, compromise of intellectual property, lost ability to ship product, breach of contract, and financial penalties.
ja: コンプライアンスの不履行は、ライセンスの喪失、知的財産の損失、製品を出荷する権利の喪失、契約破棄、罰金などの深刻な結果を招く恐れがあります。

source: Figure 1 illustrates the core elements needed in a successful FOSS compliance program that includes:
ja: 図 1 は、成功する FOSS コンプライアンス プログラムに不可欠な要素を表しており、以下のようなものが含まれます。

source: In the following subsections we examine the role of each of the elements in the OBS architecture.
ja: 次のサブセクションでは、OBS アーキテクチャの各エレメントの役割について説明します。

source: Different types of open source licenses ?
ja: さまざまなオープン ソース ライセンスのタイプ

source: The Linux Foundation has compiled this extensive checklist of compliance practices found in industry-leading compliance programs.
ja: LF では、業界をリードするコンプライアンス プログラムのさまざまなコンプライアンス事例を使用して、詳細なチェックリストを作成しました。

source: Thinking long term, while executing short term
ja: 長期的な計画を立て、短期的に実行する

source: - It helps employees understand how to work with FOSS
ja: 従業員が FOSS の取り扱い方法を理解しやすい

source: It provides choice and flexibility to create and deliver a uniquely differentiated service offering with the flexibility to support proprietary add-ons.
ja: またプロプライエタリなアドオンをサポートするための柔軟性を提供するユニークなサービスを創造および提供するためのオプションや柔軟性を提供します。◆

source: ESSENTIAL ELEMENTS OF A SUCCESSFUL COMPLIANCE PROGRAM
ja: 成功するコンプライアンス プログラムの重要な要素

source: While every organization has their own specific requirements for a build system to support their software engineering, quality assurance and deployment process, there is a core set of requirements that virtually everybody shares:
ja: どの組織にも、各組織のソフトウェア技術、品質保証、デプロイメント プロセスをサポートするために、独自のビルド システムの要件がありますが、以下のような要件は共通です。

source: - Acts as liaison between the engineering and product teams and the OSRB and OSEC in regard to usage plan approval processes
ja: FOSS の使用計画の承認プロセスに関して、エンジニアリング/プロダクト チームと OSRB/OSEC 間の連絡役となる

source: TSG Meetings http://wiki.meego.com/Technical_Steering_Group_meetings
ja: TSG ミーティング http://wiki.meego.com/Technical_Steering_Group_meetings

source: - Run the source code scanning tool over the software base
ja: - ソフトウェアごとにソース コード スキャン ツールを実行する

source: This failure occurs when the company fails to publish and/or mark the modification introduced to the FOSS that was distributed as part of a product.
ja: この違反は、企業が、製品の一部として入手した FOSS に対して行った変更を配布および/または記録しなかったときに発生する。

source: The compliance failures that can occur, how to avoid them and prevent them from happening in the future
ja: 起こり得るコンプライアンス違反、その回避策と予防策

source: Open source tools
ja: オープン ソース ツール

source: - FOSS used in the product has been registered in the FOSS inventory system
ja: 製品で使用されている FOSS が、FOSS インベントリ システムに登録されていること

source: LF384: Executive Overview of Open Source Compliance End-to-End Process
ja: LF384: オープン ソース コンプライアンス 詳細プロセス策定概要

source: More information can be found athttp://www.linuxfoundation.org/workgroups/spdx/
ja: 詳細は、下記のページをご覧ください。 http://www.linuxfoundation.org/workgroups/spdx/

source: The use of the checklist calls for a frank appraisal of a compliance program's strengths and weaknesses.
ja: このチェックリストを使用するには、コンプライアンス プログラムの十分に機能しているところと不十分なところを包み隠さず評価することが必要です。

source: The Linux Foundation’s MeeGo workgroup welcomes contributors and encourages developers and others to get involved at the site or find out more about joining the Linux Foundation at http://www.linuxfoundation.org/meego.
ja: The Linux Foundation の MeeGo ワークグループでは、コントリビューターを募集しています。詳細情報について、および参加をご希望の開発者やその他の協力者の方は、The Linux Foundation の Web サイト <http://www.linuxfoundation.org/meego> をご覧ください。

source: - Acts as liaison between OSEC and OSRB
ja: OSEC と OSRB 間の連絡役となる

source: Training is an essential building block in a compliance program to ensure that employees have a good understanding of the policies governing the use of FOSS.
ja: トレーニングは、従業員に FOSS 利用の管理ポリシーを正しく理解させるために必要な、コンプライアンス プログラムの不可欠要素です。

source: Ensuring compliance with both third party software and FOSS licensing obligations
ja: サードパーティ ソフトウェアと FOSS の両方のライセンス義務を確実に順守する

source: All non-preinstalled Operating Systems (which is in effect every Open Operating System) must be installed (or tried out as a Live CD) from some external media such as USB key, DVD or CD.
ja: プリインストールされていないすべての OS (事実上すべてのオープン OS) は、USB キー、DVD、CD などの外部メディアからインストールされる (またはライブ CD で試される) はずです。

source: To discuss which option makes most sense for your organization, please contact the Linux Foundation at compliance@linuxfoundation.org.
ja: コース内容については、The Linux Foundation までお問い合わせください。 compliance@linuxfoundation.org (info@linuxfoudation.jp ) あなたの組織に最適なオプションについて、アドバイスさせていただきます。

source: Commercial licenses are negotiated
ja: 商用ライセンスを交渉する

source: The X509 trust model, which is the one upon which web server and browser security certificates are based, allows signatures and signing keys to be traced back to a single root of trust.
ja: X509 信頼モデルは、Web サーバーとブラウザのセキュリティ証明書のベースとなるもので、署名と署名鍵について、その信頼の起点まで到達できます。

source: Example of a copyright notice (for the libpcap3 library):
ja: 著作権告知の例 (libpcap3 ライブラリの場合):

source: Bill of Material (BoM) Difference Checker
ja: BoM 比較ツール (Bill of material difference tool)

source: Corporate consumers are increasingly asking for this information, but again, there seem to be as many formats as askers.
ja: 利用者側の企業でも、こうした情報を求める声が高まっていますが、求める側にも、その企業の数と同じくらいのさまざまな形式があります。

source: Part II of the paper will follow with emphasis on FOSS compliance considerations in relation to source code modifications, notices, distribution, software design, usage, linkages and code mixing.
ja: パート Ⅱ では、ソースコードの改変、告知、配布、ソフトウェア設計、利用、リンク、コード混合などに関する FOSS コンプライアンスの考慮事項に重点を置いて説明します。

source: - Sign off on product distribution from a FOSS compliance perspective
ja: - FOSS コンプライアンスの観点から製品の配布を承認します。
